---
type: StringParameterValue
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# StringParameterValue

`Autodesk.Revit.DB.StringParameterValue` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StringParameterValue | — | `` |
| Constructor | StringParameterValue | 2016 Subscription Update | `public StringParameterValue ()` |
| Property | Value | 2016 Subscription Update | `public string Value { get ; set ; }` |